app/views/articles/show.html.erb

<h2>Comments</h2>
<%  if @article.comments.empty? %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."article_id" = ?  [["article_id", 2]]