app/controllers/articles_controller.rb

INSERT INTO "articles" ("title", "text", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "rana"], ["text", "sdg sdg dgdfg "], ["created_at", "2015-09-14 08:50:18.516110"], ["updated_at", "2015-09-14 08:50:18.516110"]]
---
    def create
      @article = Article.new
      @article = Article.new(article_params)
      if @article.save